---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomNotEnclosedRooms
source: html/ecce1bf6-3ccd-9da9-70ad-e3abc566d723.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomNotEnclosedRooms Property

[Room] is not in a properly enclosed region

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomNotEnclosedRooms { get; }
```